/* XMSG: Placeholder text in chart when there is no data */
"No Data" = "Ei tietoja";

/* XBUT: Save action in inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Save" = "Tallenna";

/* XBUT: Re-enter action available in saved state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Re-enter Signature" = "Syötä allekirjoitus uudelleen";

/* XBUT: Clear action of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Clear" = "Tyhjennä";

/* XBUT: Cancel action of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Cancel" = "Peruuta";

/* XTIT: Title of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Signature" = "Allekirjoitus";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Tap to Sign" = "Allekirjoita napauttamalla";

/* XACT: The accessibility label for the signature area */
"Signature Area" = "Allekirjoitusalue";

/* XACT: The accessibility hint for the signature area */
"Double tap and drag to sign" = "Kaksoisnapsauta ja vedä allekirjoittaaksesi";

/* XACT: The accessibility label for the signature image */
"Signature Image" = "Allekirjoituskuva";

/* XACT: The accessibility label for the signature line */
"Signature Line" = "Allekirjoitusrivi";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Canceled" = "Peruutettu";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Next" = "Seuraava";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Ok" = "OK";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Status" = "Tila";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"User canceled Onboarding" = "Käyttäjä peruutti käyttöönoton";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Without consent you will not be able to continue onboarding." = "Et voi jatkaa käyttöönottoa ilman suostumusta.";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Give Consent" = "Anna suostumus";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Quit" = "Lopeta";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Back" = "Paluu";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Step" = "Askel";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"of" = "/";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Are you sure you want to quit the onboarding process?" = "Haluatko varmasti lopettaa käyttöönottoprosessin?";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Want Data Privacy?" = "Haluatko tietosuojan?";

/* XBUT: Action available in inactive state of inline signature form cell, see https://experience.sap.com/fiori-design-ios/article/in-line-signature-form-cell/#behavior-and-interaction */
"Be wise about your data" = "Käytä tietoja harkiten";

/* XBUT: Not Now action title in UserConsentForm */
"Not Now" = "Ei nyt";

/* XBUT: Allow action title in UserConsentForm */
"Allow" = "Salli";

/* XBUT: Deny action title in UserConsentForm */
"Deny" = "Kiellä";

/* XBUT: Agree action title in EULAView */
"Agree" = "Hyväksyn";

/* XBUT: Disagree action title in EULAView */
"Disagree" = "En hyväksy";

/* XMSG: Placeholder text in DataTable for loading state */
"Loading..." = "Ladataan...";

/* XMSG: Placeholder text in DataTable when there is no data */
"There is nothing to display yet" = "Mitään näytettävää ei vielä ole";

/* XBUT: Default duration foramtter in DataTable */
"%d Hrs %d Min" = "%d t %d min";

/* XBUT: Done action in keyboard toolbar for a Textfield in DataTable */
"Done" = "Valmis";

/* XBUT: Error messages shown to users in DataTable */
"There are %d errors in the data table." = "Datataulussa on %d virhettä.";

/* XBUT: voice over label for row header in DataTable */
"row header" = "rivin otsikko";

/* XBUT: voice over label for row %d in DataTable */
"row %d" = "rivi %d";

/* XBUT: voice over label for column %d in DataTable */
"column %d" = "sarake %d";

/* XBUT: voice over label for cell type of `leading accessory` in DataTable */
"leading accessory" = "alkuvaruste";

/* XBUT: voice over label for cell type of `trailing accessory` in DataTable */
"trailing accessory" = "loppuvaruste";

/* XBUT: voice over label for cell type of `text` in DataTable */
"text" = "teksti";

/* XBUT: voice over label for cell type of `image` in DataTable */
"image" = "kuva";

/* XBUT: voice over label for cell type of `date` in DataTable */
"date" = "päivämäärä";

/* XBUT: voice over label for cell type of `time` in DataTable */
"time" = "kellonaika";

/* XBUT: voice over label for cell type of `duration` in DataTable */
"duration" = "kesto";

/* XBUT: voice over label for cell type of `list item` in DataTable */
"list item" = "luettelokohde";

/* XBUT: voice over label for row selection status in DataTable */
"selected" = "valittu";

/* XBUT: voice over label for row selection status in DataTable */
"not selected" = "ei valittu";

/* XBUT: calendar time component label */
"Time" = "Kellonaika";

/* XBUT: slider default value label formatter for integer */
"Value: %d" = "Arvo: %d";

/* XMSG: a toast message for read-only cell in DataTable */
"Tapped cell is read-only." = "Napautettu solu on kirjoitussuojattu.";

/* Default hint text for Read-only Field for NoteFormView and TextFieldFormView */
"Read-only field" = "Kirjoitussuojattu kenttä";

/* Default error text for when the character count reaches the maximum limit for NoteFormView and TextFieldFormView */
"No more characters remaining" = "Ei merkkejä jäljellä";

/* Default error text for when the character count exceeds the maximum limit for NoteFormView and TextFieldFormView */
"Reduce the number of characters" = "Vähennä merkkien määrää";

